#coding: utf-8
#题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高
#　　　于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提
#　　　成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于
#　　　40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于
#　　　100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

ls = int(input("请您输入您获得的利润："))


def prem(ls):
    if ls <=100000:
        bonus = ls*0.1

    elif ls <=200000 and ls >100000:
        bonus = 100000*0.1+(ls-100000)*0.075
    elif ls <=400000 and ls >200000:
        bonus = 100000*0.1+100000*0.075+(ls-200000)*0.05
    elif ls<=600000 and ls>400000:
        bonus = 100000*0.1+100000*0.075+200000*0.05+(ls-400000)*0.03
    elif ls<=1000000 and ls>600000:
        bonus = 100000*0.1+100000*0.075+200000*0.05+200000*0.03+(ls-600000)*0.015
    else:
        bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015+(ls-1000000)*0.1
    print("奖金总数为{0}:".format(bonus))

prem(ls)